src/InformationRegisters/Дампы/Дампы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Дампы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВОчередиНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Обрабатывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогЭкспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасположениеТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеОбработкиДампа</name>
    <type>
      <types>EnumRef.СостоянияОбработкиДампа</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяБезРасширения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВременногоАрхива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАрхивирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияАрхивирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭкспорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияЭкспорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоПовтора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДампа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантДампа</name>
    <type>
      <types>CatalogRef.ВариантыДампов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяФайлаДампа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДампа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Дампы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция РезультатЗапросаВМассив(Результат)
	РезультатМассив = Новый Массив;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеСтроки = Новый Структура;
		
		Для Каждого ТекКолонка Из Результат.Колонки Цикл
			ДанныеСтроки.Вставить(ТекКолонка.Имя, Выборка[ТекКолонка.Имя]);
		КонецЦикла;
		
		РезультатМассив.Добавить(ДанныеСтроки);
	КонецЦикла;	
	
	Возврат РезультатМассив;
КонецФункции

Функция ВыбратьПоСостояниюОбработки(СостояниеОбработки) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Дампы КАК Дампы
	|ГДЕ
	|	Дампы.СостояниеОбработкиДампа = &СостояниеОбработки
	|УПОРЯДОЧИТЬ ПО
	|	Дампы.Период
	|";
	
	Запрос.УстановитьПараметр("СостояниеОбработки", СостояниеОбработки);	
	Результат = Запрос.Выполнить();
	Данные = РезультатЗапросаВМассив(Результат);
	
	Возврат Данные;
КонецФункции

Функция ВыбратьПоСостояниямОбработки(СостоянияОбработки) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.Дампы КАК Дампы
	|ГДЕ
	|	Дампы.СостояниеОбработкиДампа В (&СостоянияОбработки)
	|УПОРЯДОЧИТЬ ПО
	|	Дампы.Период
	|";
	
	Запрос.УстановитьПараметр("СостоянияОбработки", СостоянияОбработки);	
	Результат = Запрос.Выполнить();
	Данные = РезультатЗапросаВМассив(Результат);
	
	Возврат Данные;
КонецФункции

Функция ИзменитьЗапись(ДанныеЗаписиРегистра) Экспорт
	НаборЗаписей = РегистрыСведений.Дампы.СоздатьНаборЗаписей();
	
	Регистр = Метаданные.РегистрыСведений.Дампы;
	
	Если Регистр.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый И Регистр.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		НаборЗаписей["Отбор"]["Период"].Установить(ДанныеЗаписиРегистра["Период"]);
	КонецЕсли;
	
	Для Каждого ТекИзмерение Из Метаданные.РегистрыСведений.Дампы.Измерения Цикл
		НаборЗаписей["Отбор"][ТекИзмерение.Имя].Установить(ДанныеЗаписиРегистра[ТекИзмерение.Имя]);
	КонецЦикла;
	
	НовЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НовЗапись, ДанныеЗаписиРегистра);	
	
	Попытка
		НаборЗаписей.Записать(Истина);
		Справочники.ВариантыДампов.ПриИзмененииЗаписиДампа(ДанныеЗаписиРегистра.ВариантДампа, ДанныеЗаписиРегистра.СостояниеОбработкиДампа);
	Исключение
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Функция ЗаписатьРазмерФайла(...)",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.Дампы,
			,
			Комментарий);
	КонецПопытки;
КонецФункции

Процедура ПереименоватьДамп(ДанныеЗаписиРегистра, НовоеИмяДампа) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Дампы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписиРегистра);
	МенеджерЗаписи.Прочитать();
	
	ФайлДампа = Новый Файл(НовоеИмяДампа);
	
	Попытка
		ПереместитьФайл(ДанныеЗаписиРегистра.ПолноеИмя, НовоеИмяДампа);
	Исключение
		Инфо = ИнформацияОбОшибке();
		Комментарий =
			"Описание = '" +Инфо.Описание + "', " +
			"ИмяМодуля = '" + Инфо.ИмяМодуля + "', " +
			"НомерСтроки = '" + Инфо.НомерСтроки + "', " +
			"ИсходнаяСтрока = '" + Инфо.ИсходнаяСтрока + "'.";
		ЗаписьЖурналаРегистрации("Ошибка переименования файла " + ФайлДампа.ПолноеИмя, УровеньЖурналаРегистрации.Информация,,,Комментарий);
		Возврат
	КонецПопытки;
	
	МенеджерЗаписи.ИмяФайлаДампа = ФайлДампа.Имя;
	МенеджерЗаписи.ПолноеИмя = ФайлДампа.ПолноеИмя;
	МенеджерЗаписи.ИмяБезРасширения = ФайлДампа.ИмяБезРасширения;
	
	МенеджерЗаписи.Записать(Истина);
	
	ЗаполнитьЗначенияСвойств(ДанныеЗаписиРегистра, МенеджерЗаписи);
	
КонецПроцедуры

#КонецЕсли
